/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: hoitFsMid.h
**
** 创   建   人: 潘延麒
**
** 文件创建日期: 2021 年 03 月 19 日
**
** 描        述: 中间层，用于拓展架构
*********************************************************************************************************/

#ifndef SYLIXOS_EXTFS_HOITFS_HOITFSMID_H_
#define SYLIXOS_EXTFS_HOITFS_HOITFSMID_H_



#endif /* SYLIXOS_EXTFS_HOITFS_HOITFSMID_H_ */
