/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: bspLib.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2007 年 12 月 09 日
**
** 描        述: S3C2440 需要为 SylixOS 提供的功能支持.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "config.h"
#include "SylixOS.h"
#include "driver/timer/timer.h"
#include "driver/tty/uart.h"
/*********************************************************************************************************
  BSP 信息
*********************************************************************************************************/
static const char   _G_pcCpuInfo[]     = "SAMSUNG S3C2440A (ARM920T 405/101MHz NonFPU)";
static const char   _G_pcCacheInfo[]   = "32KBytes L1-Cache (D-16K/I-16K)";
static const char   _G_pcPacketInfo[]  = "Mini2440 Packet";
static const char   _G_pcVersionInfo[] = "BSP version 5.1.2 for "__SYLIXOS_RELSTR;
/*********************************************************************************************************
  中断相关
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspIntInit
** 功能描述: 中断系统初始化
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspIntInit (VOID)
{
    API_InterVectorSetFlag(LW_IRQ_4,  LW_IRQ_FLAG_QUEUE);               /*  EINT 4 ~ 7                  */
    API_InterVectorSetFlag(LW_IRQ_5,  LW_IRQ_FLAG_QUEUE);               /*  EINT 8 ~ 23                 */
    API_InterVectorSetFlag(LW_IRQ_0,  LW_IRQ_FLAG_SAMPLE_RAND);         /*  EINT 0 used to sample random*/
}
/*********************************************************************************************************
** 函数名称: bspIntHandle
** 功能描述: 中断入口
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspIntHandle (VOID)
{
    REGISTER UINT32   uiIrqVic = rINTOFFSET;

    archIntHandle((ULONG)uiIrqVic, LW_FALSE);
}
/*********************************************************************************************************
** 函数名称: bspIntVectorEnable
** 功能描述: 使能指定的中断向量
** 输  入  : ulVector     中断向量
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspIntVectorEnable (ULONG  ulVector)
{
    INTER_CLR_MSK((1u << ulVector));
}
/*********************************************************************************************************
** 函数名称: bspIntVectorDisable
** 功能描述: 禁能指定的中断向量
** 输  入  : ulVector     中断向量
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspIntVectorDisable (ULONG  ulVector)
{
    INTER_SET_MSK((1u << ulVector));
}
/*********************************************************************************************************
** 函数名称: bspIntVectorIsEnable
** 功能描述: 检查指定的中断向量是否使能
** 输  入  : ulVector     中断向量
** 输  出  : LW_FALSE 或 LW_TRUE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
BOOL  bspIntVectorIsEnable (ULONG  ulVector)
{
    return  (INTER_GET_MSK((1u << ulVector)) ? LW_FALSE : LW_TRUE);
}
/*********************************************************************************************************
** 函数名称: bspIntVectorSetPriority
** 功能描述: 设置指定的中断向量的优先级
** 输  入  : ulVector     中断向量号
**           uiPrio       优先级
** 输　出  : ERROR CODE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
#if LW_CFG_INTER_PRIO > 0

ULONG   bspIntVectorSetPriority (ULONG  ulVector, UINT  uiPrio)
{
    return  (ERROR_NONE);
}
/*********************************************************************************************************
** 函数名称: bspIntVectorGetPriority
** 功能描述: 获取指定的中断向量的优先级
** 输  入  : ulVector     中断向量号
**           puiPrio      优先级
** 输　出  : ERROR CODE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
ULONG   bspIntVectorGetPriority (ULONG  ulVector, UINT  *puiPrio)
{
    *puiPrio = 0;
    return  (ERROR_NONE);
}

#endif                                                                  /*  LW_CFG_INTER_PRIO > 0       */
/*********************************************************************************************************
** 函数名称: bspIntVectorSetTarget
** 功能描述: 设置指定的中断向量的目标 CPU
** 输　入  : ulVector      中断向量号
**           stSize        CPU 掩码集内存大小
**           pcpuset       CPU 掩码
** 输　出  : ERROR CODE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
#if LW_CFG_INTER_TARGET > 0

ULONG   bspIntVectorSetTarget (ULONG  ulVector, size_t  stSize, const PLW_CLASS_CPUSET  pcpuset)
{
    return  (ERROR_NONE);
}
/*********************************************************************************************************
** 函数名称: bspIntVectorGetTarget
** 功能描述: 获取指定的中断向量的目标 CPU
** 输　入  : ulVector      中断向量号
**           stSize        CPU 掩码集内存大小
**           pcpuset       CPU 掩码
** 输　出  : ERROR CODE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
ULONG   bspIntVectorGetTarget (ULONG  ulVector, size_t  stSize, PLW_CLASS_CPUSET  pcpuset)
{
    LW_CPU_ZERO(pcpuset);
    LW_CPU_SET(0, pcpuset);
    return  (ERROR_NONE);
}

#endif                                                                  /*  LW_CFG_INTER_TARGET > 0     */
/*********************************************************************************************************
  BSP 信息
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspInfoCpu
** 功能描述: BSP CPU 信息
** 输　入  : NONE
** 输　出  : CPU 信息
** 全局变量:
** 调用模块:
*********************************************************************************************************/
CPCHAR  bspInfoCpu (VOID)
{
    return  (_G_pcCpuInfo);
}
/*********************************************************************************************************
** 函数名称: bspInfoCache
** 功能描述: BSP CACHE 信息
** 输　入  : NONE
** 输　出  : CACHE 信息
** 全局变量:
** 调用模块:
*********************************************************************************************************/
CPCHAR  bspInfoCache (VOID)
{
    return  (_G_pcCacheInfo);
}
/*********************************************************************************************************
** 函数名称: bspInfoPacket
** 功能描述: BSP PACKET 信息
** 输　入  : NONE
** 输　出  : PACKET 信息
** 全局变量:
** 调用模块:
*********************************************************************************************************/
CPCHAR  bspInfoPacket (VOID)
{
    return  (_G_pcPacketInfo);
}
/*********************************************************************************************************
** 函数名称: bspInfoVersion
** 功能描述: BSP VERSION 信息
** 输　入  : NONE
** 输　出  : BSP VERSION 信息
** 全局变量:
** 调用模块:
*********************************************************************************************************/
CPCHAR  bspInfoVersion (VOID)
{
    return  (_G_pcVersionInfo);
}
/*********************************************************************************************************
** 函数名称: bspInfoHwcap
** 功能描述: BSP 硬件特性
** 输　入  : NONE
** 输　出  : 硬件特性 (如果支持硬浮点, 可以加入 HWCAP_VFP , HWCAP_VFPv3 , HWCAP_VFPv3D16 , HWCAP_NEON)
** 全局变量:
** 调用模块:
*********************************************************************************************************/
ULONG  bspInfoHwcap (VOID)
{
    return  (0ul);
}
/*********************************************************************************************************
** 函数名称: bspInfoRomBase
** 功能描述: BSP ROM 基地址
** 输　入  : NONE
** 输　出  : ROM 基地址
** 全局变量:
** 调用模块:
*********************************************************************************************************/
addr_t bspInfoRomBase (VOID)
{
    return  (0x00000000);
}
/*********************************************************************************************************
** 函数名称: bspInfoRomSize
** 功能描述: BSP ROM 大小
** 输　入  : NONE
** 输　出  : ROM 大小
** 全局变量:
** 调用模块:
*********************************************************************************************************/
size_t bspInfoRomSize (VOID)
{
    return  (1024 * 1024 * 2);
}
/*********************************************************************************************************
** 函数名称: bspInfoRamBase
** 功能描述: BSP RAM 基地址
** 输　入  : NONE
** 输　出  : RAM 基地址
** 全局变量:
** 调用模块:
*********************************************************************************************************/
addr_t bspInfoRamBase (VOID)
{
    return  (0x30000000);
}
/*********************************************************************************************************
** 函数名称: bspInfoRamSize
** 功能描述: BSP RAM 大小
** 输　入  : NONE
** 输　出  : RAM 大小
** 全局变量:
** 调用模块:
*********************************************************************************************************/
size_t bspInfoRamSize (VOID)
{
    return  (1024 * 1024 * 64);
}
/*********************************************************************************************************
  BSP HOOK
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspTaskCreateHook
** 功能描述: 任务创建 hook
** 输  入  : ulId     任务 ID
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTaskCreateHook (LW_OBJECT_ID  ulId)
{
    (VOID)ulId;
}
/*********************************************************************************************************
** 函数名称: bspTaskDeleteHook
** 功能描述: 任务删除 hook
** 输  入  : ulId         任务 ID
**           pvReturnVal  返回值
**           ptcb         任务控制块
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTaskDeleteHook (LW_OBJECT_ID  ulId, PVOID  pvReturnVal, PLW_CLASS_TCB  ptcb)
{
    (VOID)ulId;
    (VOID)pvReturnVal;
    (VOID)ptcb;
}
/*********************************************************************************************************
** 函数名称: bspTaskSwapHook
** 功能描述: 任务切换 hook
** 输  入  : hOldThread       被换出的任务
**           hNewThread       要运行的任务
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTaskSwapHook (LW_OBJECT_HANDLE   hOldThread, LW_OBJECT_HANDLE   hNewThread)
{
    (VOID)hOldThread;
    (VOID)hNewThread;
}
/*********************************************************************************************************
** 函数名称: bspTaskIdleHook
** 功能描述: idle 任务调用此函数
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTaskIdleHook (VOID)
{
}
/*********************************************************************************************************
** 函数名称: bspTaskIdleHook
** 功能描述: 每个操作系统时钟节拍，系统将调用这个函数
** 输  入  : i64Tick      系统当前时钟
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTickHook (INT64   i64Tick)
{
    (VOID)i64Tick;
}
/*********************************************************************************************************
** 函数名称: bspWdTimerHook
** 功能描述: 看门狗定时器到时间时都会调用这个函数
** 输  入  : ulId     任务 ID
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspWdTimerHook (LW_OBJECT_ID  ulId)
{
    (VOID)ulId;
}
/*********************************************************************************************************
** 函数名称: bspTCBInitHook
** 功能描述: 初始化 TCB 时会调用这个函数
** 输  入  : ulId     任务 ID
**           ptcb     任务控制块
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTCBInitHook (LW_OBJECT_ID  ulId, PLW_CLASS_TCB   ptcb)
{
    (VOID)ulId;
    (VOID)ptcb;
}
/*********************************************************************************************************
** 函数名称: bspKernelInitHook
** 功能描述: 系统初始化完成时会调用这个函数
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspKernelInitHook (VOID)
{
}
/*********************************************************************************************************
** 函数名称: bspReboot
** 功能描述: 系统重新启动
** 输　入  : iRebootType       重启类型
**           ulStartAddress    启动开始地址
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspReboot (INT  iRebootType, addr_t  ulStartAddress)
{
    (VOID)ulStartAddress;

#ifdef __BOOT_INRAM
    ((VOID (*)(INT))bspInfoRamBase())(iRebootType);
#else
    ((VOID (*)(INT))bspInfoRomBase())(iRebootType);
#endif                                                                  /*  __BOOT_INRAM                */
}
/*********************************************************************************************************
** 函数名称: bspDebugMsg
** 功能描述: 打印系统调试信息
** 输　入  : pcMsg     信息
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspDebugMsg (CPCHAR  pcMsg)
{
    uartSendString(COM0, (PCHAR)pcMsg);
}
/*********************************************************************************************************
  CACHE 相关接口
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspL2CBase
** 功能描述: 获得 L2 控制器基地址
** 输  入  : pulBase      返回的基地址
** 输  出  : -1 表示不启用 L2
** 全局变量:
** 调用模块:
*********************************************************************************************************/
INT  bspL2CBase (addr_t  *pulBase)
{
    return  (PX_ERROR);
}
/*********************************************************************************************************
** 函数名称: bspL2CAux
** 功能描述: 获得 L2 控制器 Aux 控制掩码
** 输  入  : puiAuxVal      Aux 寄存器值
**           puiAuxMask     Aux 控制掩码
** 输  出  : -1 表示不启用 L2
** 全局变量:
** 调用模块:
*********************************************************************************************************/
INT  bspL2CAux (UINT32  *puiAuxVal, UINT32  *puiAuxMask)
{
    *puiAuxVal  =  0u;
    *puiAuxMask = ~0u;
    
    return  (ERROR_NONE);
}
/*********************************************************************************************************
  MMU 相关接口
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspMmuPgdMaxNum
** 功能描述: 获得 PGD 池的数量
** 输  入  : NONE
** 输  出  : PGD 池的数量 (1 个池可映射 4GB 空间, 推荐返回 1)
** 全局变量:
** 调用模块:
*********************************************************************************************************/
ULONG  bspMmuPgdMaxNum (VOID)
{
    return  (1);
}
/*********************************************************************************************************
** 函数名称: bspMmuPgdMaxNum
** 功能描述: 获得 PTE 池的数量
** 输  入  : NONE
** 输  出  : PTE 池的数量 (映射 4GB 空间, 需要 4096 个 PTE 池)
** 全局变量:
** 调用模块:
*********************************************************************************************************/
ULONG  bspMmuPteMaxNum (VOID)
{
    return  (2048);
}
/*********************************************************************************************************
  操作系统多核接口
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspMpInt
** 功能描述: 产生一个核间中断
** 输  入  : ulCPUId      目标 CPU
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID   bspMpInt (ULONG  ulCPUId)
{
    (VOID)ulCPUId;
}
/*********************************************************************************************************
** 函数名称: bspCpuUp
** 功能描述: 启动一个 CPU
** 输  入  : ulCPUId      目标 CPU
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID   bspCpuUp (ULONG  ulCPUId)
{
    bspDebugMsg("bspCpuUp() error: this cpu CAN NOT support this operate!\r\n");
}
/*********************************************************************************************************
** 函数名称: bspCpuDown
** 功能描述: 停止一个 CPU
** 输  入  : ulCPUId      目标 CPU
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID   bspCpuDown (ULONG  ulCPUId)
{
    bspDebugMsg("bspCpuDown() error: this cpu CAN NOT support this operate!\r\n");
}
/*********************************************************************************************************
  操作系统 CPU 速度控制接口
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspSuspend
** 功能描述: 系统进入休眠状态
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID    bspSuspend (VOID)
{
    bspDebugMsg("bspSuspend() error: this BSP CAN NOT support this operate!\r\n");
}
/*********************************************************************************************************
** 函数名称: bspCpuPowerSet
** 功能描述: CPU 设置运行速度
** 输  入  : uiPowerLevel     运行速度级别
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID    bspCpuPowerSet (UINT  uiPowerLevel)
{
}
/*********************************************************************************************************
** 函数名称: bspCpuPowerGet
** 功能描述: CPU 获取运行速度
** 输  入  : puiPowerLevel    运行速度级别
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID    bspCpuPowerGet (UINT  *puiPowerLevel)
{
    if (puiPowerLevel) {
        *puiPowerLevel = LW_CPU_POWERLEVEL_TOP;
    }
}
/*********************************************************************************************************
  操作系统时间相关函数
*********************************************************************************************************/
/*********************************************************************************************************
  TICK 服务相关配置
*********************************************************************************************************/
#define TICK_IN_THREAD  0
#if TICK_IN_THREAD > 0
static LW_HANDLE    htKernelTicks;                                      /*  操作系统时钟服务线程句柄    */
#endif                                                                  /*  TICK_IN_THREAD > 0          */
/*********************************************************************************************************
** 函数名称: __tickThread
** 功能描述: 初始化 tick 服务线程
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
#if TICK_IN_THREAD > 0

static VOID  __tickThread (VOID)
{
    for (;;) {
        API_ThreadSuspend(htKernelTicks);
        API_KernelTicks();                                              /*  内核 TICKS 通知             */
        API_TimerHTicks();                                              /*  高速 TIMER TICKS 通知       */
    }
}

#endif                                                                  /*  TICK_IN_THREAD > 0          */
/*********************************************************************************************************
** 函数名称: __tickTimerIsr
** 功能描述: tick 定时器中断服务程序
** 输  入  : NONE
** 输  出  : 中断服务返回
** 全局变量:
** 调用模块:
*********************************************************************************************************/
static irqreturn_t  __tickTimerIsr (VOID)
{
    INTER_CLR_PNDING(BIT_TIMER4);                                       /*  清除中断                    */

    API_KernelTicksContext();                                           /*  保存被时钟中断的线程控制块  */

#if TICK_IN_THREAD > 0
    API_ThreadResume(htKernelTicks);
#else
    API_KernelTicks();                                                  /*  内核 TICKS 通知             */
    API_TimerHTicks();                                                  /*  高速 TIMER TICKS 通知       */
#endif                                                                  /*  TICK_IN_THREAD > 0          */
    
    return  (LW_IRQ_HANDLED);
}
/*********************************************************************************************************
  精确时间换算参数
*********************************************************************************************************/
static UINT32   GuiFullCnt;
static UINT64   Gui64NSecPerCnt7;                                       /*  提高 7bit 精度              */
/*********************************************************************************************************
** 函数名称: bspTickInit
** 功能描述: 初始化 tick 时钟
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTickInit (VOID)
{
#if TICK_IN_THREAD > 0
    LW_CLASS_THREADATTR threadattr;
#endif                                                                  /*  TICK_IN_THREAD > 0          */

    GuiFullCnt       = (UINT16)((PCLK / 800) / LW_TICK_HZ);
    Gui64NSecPerCnt7 = ((1000 * 1000 * 1000 / LW_TICK_HZ) << 7) / GuiFullCnt;

#if TICK_IN_THREAD > 0
    API_ThreadAttrBuild(&threadattr, (8 * LW_CFG_KB_SIZE),
                        LW_PRIO_T_TICK,
                        LW_OPTION_THREAD_STK_CHK |
                        LW_OPTION_THREAD_UNSELECT |
                        LW_OPTION_OBJECT_GLOBAL |
                        LW_OPTION_THREAD_SAFE, LW_NULL);

    htKernelTicks = API_ThreadCreate("t_tick",
                                     (PTHREAD_START_ROUTINE)__tickThread,
                                     &threadattr,
                                     NULL);
#endif                                                                  /*  TICK_IN_THREAD > 0          */

    API_InterVectorConnect(LW_IRQ_14,
                           (PINT_SVR_ROUTINE)__tickTimerIsr,
                           LW_NULL,
                           "tick_timer");

    timerSetPrescaler(1, 99);
    timerSetMuxCnt(4, 2);
    timerSetCnt(4, (UINT16)GuiFullCnt - 1);
    timerConfig(4, TIMER_MANUAL_UPDATE);
    timerConfig(4, TIMER_ENABLE | TIMER_RELOAD | TIMER_UNMANUAL_UPDATE);

    API_InterVectorEnable(LW_IRQ_14);
}
/*********************************************************************************************************
** 函数名称: bspTickHighResolution
** 功能描述: 修正从最近一次 tick 到当前的精确时间.
** 输　入  : ptv       需要修正的时间
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTickHighResolution (struct timespec *ptv)
{
    REGISTER UINT32  uiCntCur, uiDone;

    uiCntCur = (UINT32)timerGetCnt(4);
    uiDone   = GuiFullCnt - uiCntCur;

    /*
     *  检查是否有 TICK 中断请求
     */
    if (rSRCPND & BIT_TIMER4) {
        /*
         *  这里由于 TICK 没有及时更新, 所以需要重新获取并且加上一个 TICK 的时间
         */
        uiCntCur = (UINT32)timerGetCnt(4);
        uiDone   = GuiFullCnt - uiCntCur;

        if (uiCntCur != 0) {
            uiDone   += GuiFullCnt;
        }
    } else {
        if (uiCntCur == 0) {
            uiDone = 0;
        }
    }

    ptv->tv_nsec += (LONG)((Gui64NSecPerCnt7 * uiDone) >> 7);
    if (ptv->tv_nsec >= 1000000000) {
        ptv->tv_nsec -= 1000000000;
        ptv->tv_sec++;
    }
}
/*********************************************************************************************************
** 函数名称: bspDelayUs
** 功能描述: 延迟微秒
** 输  入  : ulUs     微秒数
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID bspDelayUs (ULONG ulUs)
{
    volatile UINT i;

    while (ulUs) {
        ulUs--;
        for (i = 0; i < 80; i++) {
        }
    }
}
/*********************************************************************************************************
** 函数名称: bspDelayNs
** 功能描述: 延迟纳秒
** 输  入  : ulNs     纳秒数
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspDelayNs (ULONG ulNs)
{
    volatile UINT i;

    while (ulNs) {
        ulNs = (ulNs < 100) ? (0) : (ulNs - 100);
        for (i = 0; i < 8; i++) {
        }
    }
}
/*********************************************************************************************************
  GCC 需求
*********************************************************************************************************/
#ifdef __GNUC__
int  __aeabi_read_tp (void)
{
    return  (0);
}
#endif                                                                  /*  __GNUC__                    */
/*********************************************************************************************************
  END
*********************************************************************************************************/
