/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: samsungdma.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2007 年 09 月 19 日
**
** 描        述: DMA 驱动程序
*********************************************************************************************************/

#ifndef __SAMSUNGDMA_H
#define __SAMSUNGDMA_H

/*********************************************************************************************************
  体系结构相关的控制参数 DMAT_iTransMode
*********************************************************************************************************/

#define DMA_TRANSMODE_SINGLE    0x00000000                              /*  单次传输                    */
#define DMA_TRANSMODE_WHOLE     0x00000001                              /*  完全传输                    */

#define DMA_TRANSMODE_CLKAPB    0x00000000                              /*  APB 时钟源                  */
#define DMA_TRANSMODE_CLKAHB    0x00000002                              /*  AHB 时钟源                  */

#define DMA_TRANSMODE_NORMAL    0x00000000                              /*  正常方式传输                */
#define DMA_TRANSMODE_BURST     0x00000004                              /*  突发模式传输                */

#define DMA_TRANSMODE_ONESHOT   0x00000000                              /*  传输完成后, 不进行重载      */
#define DMA_TRANSMODE_RELOAD    0x00000008                              /*  传输完成后, 自动重载        */

#define DMA_TRANSMODE_BYTE      0x00000000                              /*  字节传输                    */
#define DMA_TRANSMODE_DBYTE     0x00000010                              /*  半字传输                    */
#define DMA_TRANSMODE_4BYTE     0x00000020                              /*  字传输                      */

/*********************************************************************************************************
  体系结构相关的控制参数 DMAT_ulOption
*********************************************************************************************************/

#define DMA_OPTION_SRCBUS_AHB   0x00000000                              /*  源端 AHB 总线通道           */
#define DMA_OPTION_SRCBUS_APB   0x00000001                              /*  源端 APB 总线通道           */

#define DMA_OPTION_DSTBUS_AHB   0x00000000                              /*  目标 AHB 总线通道           */
#define DMA_OPTION_DSTBUS_APB   0x00000002                              /*  目标 APB 总线通道           */

/*********************************************************************************************************
** Function name:           dmaGetFuncs
** Descriptions:            获取 2440 DMA 驱动
** input parameters:        iChannel        DMA 通道号
** output parameters:       pulMaxBytes     最大传输字节数
** Returned value:          指定通道 DMA 控制器操作函数集
*********************************************************************************************************/
PLW_DMA_FUNCS  dmaGetFuncs(int   iChannel, ULONG   *pulMaxBytes);

#endif                                                                  /*  __SAMSUNGDMA_H              */
/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
